# Выведите в консоль таблицу умножения от 2х2 до 9х10 как на школьной тетрадке.

# for i in range(2,11):
#     j = 2
#     res = i * j
#     print(j,'*', i, '=', res)
# j += 1

i = 2
j = 2
while i <= 10:
    res = j * i
    print(j,'*', i, '=', res)
    i += 1    
# Дальше ничего пока не идет, буду ждать разбора  
