# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

integer = 34
_float = 4.0
string = 'Hello'
boolean = True
print('var: ', integer, ' type: ', type(integer),
      ' id: ', id(integer), ' hash: ', hash(integer))
print('var: ', _float, ' type: ', type(_float),
      ' id: ', id(_float), ' hash: ', hash(_float))
print('var: ', string, ' type: ', type(string),
      ' id: ', id(string), ' hash: ', hash(string))
print('var: ', boolean, ' type: ', type(boolean),
      ' id: ', id(boolean), ' hash: ', hash(boolean))
